GestiLibro/app/Observers/AuditObserver.php

INSERT INTO `auditoria` (`entidad`, `entidad_id`, `accion`, `detalle`, `user_id`, `fecha`) VALUES ('App\\Models\\CategoriaModel', 3, 'insert', '{\"nombre\":\"Terror\",\"descripcion\":\"da miedo\"}', NULL, '2026-04-02 23:37:11')
---
    public function handle(string $evento, array $payload): void
    {
        $db = \Config\Database::connect();
        $db->table('auditoria')->insert([
            'entidad'     => $payload['model'],
            'entidad_id'  => $payload['id'] ?? null,
            'accion'      => $evento,
            'detalle'     => json_encode($payload['data'] ?? []),
            'user_id'     => session()->get('user')['id_usuario'] ?? null,
            'fecha'       => date('Y-m-d H:i:s'),
        ]);

INSERT INTO `auditoria` (`accion`, `entidad`, `user_id`, `fecha`, `detalle`) VALUES ('logout', 'Login', '1', '2026-04-09 23:16:07', '{\"id_usuario\":\"1\",\"nombreCompleto\":\"\",\"username\":\"admin\",\"id_rol\":\"1\"}')
---
    public static function onUserLoggedIn($user,$logout=null)
    {
        $accion = 'login';
        // Si usas tabla auditoría:
        if($logout){
            $accion = 'logout';
        }

        $db = \Config\Database::connect();
        $db->table('auditoria')->insert([
            'accion' => $accion,
            'entidad' => 'Login',
            'user_id' => $user['id_usuario'],
            'fecha' => date('Y-m-d H:i:s'),
            'detalle' => json_encode($user),
        ]);