GestiLibro/app/Views/layouts/sidebar.php

SELECT *
FROM `Usuario`
WHERE `Usuario`.`id_usuario` = '1'
---

    if ($authUser && !empty($authUser['id_usuario'])) {
        $usuarioModel = new \App\Models\UsuarioModel();
        $usuarioBD = $usuarioModel->find($authUser['id_usuario']);