GestiLibro/app/Controllers/AuditoriaController.php

SELECT `a`.*, `u`.`username`, `u`.`nombre`, `u`.`apellido`
FROM `auditoria` `a`
LEFT JOIN `usuario` `u` ON `u`.`id_usuario` = `a`.`user_id`
ORDER BY `a`.`fecha` DESC
---
    public function index()
    {
        $db = \Config\Database::connect();

        $usuario = $this->request->getGet('usuario');
        $accion  = $this->request->getGet('accion');
        $fecha   = $this->request->getGet('fecha');

        $builder = $db->table('auditoria a');
        $builder->select('a.*, u.username, u.nombre, u.apellido');
        $builder->join('usuario u', 'u.id_usuario = a.user_id', 'left');

        if (!empty($usuario)) {
            $builder->where('LOWER(u.username)', strtolower($usuario));
        }

        if (!empty($accion)) {
            $builder->where('a.accion', $accion);
        }

        if (!empty($fecha)) {
            $builder->where('DATE(a.fecha)', $fecha);
        }

        $builder->orderBy('a.fecha', 'DESC');

        $data['auditorias'] = $builder->get()->getResult();