GestiLibro/app/Controllers/CategoriaController.php

    public function index()
    {
        $model = new CategoriaModel();
        $data['categorias'] = $model->findAll();
---
SELECT *
FROM `Categoria`

    public function store()
    {
        $nombre = trim($this->request->getPost('nombre'));
        $descripcion = trim($this->request->getPost('descripcion'));

        if (empty($nombre)) {
            return redirect()->to(site_url('categorias/create'))
                ->withInput()
                ->with('warning', 'El nombre de la categoría es obligatorio.');
        }

        $categoriaExistente = $this->categoriaModel
            ->where('nombre', $nombre)
            ->first();

        if ($categoriaExistente) {
            return redirect()->to(site_url('categorias/create'))
                ->withInput()
                ->with('warning', 'Ya existe una categoría con ese nombre.');
        }

        try {
            $this->categoriaModel->insert([
                'nombre' => $nombre,
                'descripcion' => $descripcion,
            ]);
---
SELECT *
FROM `Categoria`
WHERE `nombre` = 'Terror'
 LIMIT 1
INSERT INTO `Categoria` (`nombre`, `descripcion`) VALUES ('Terror', 'da miedo')

    public function update($id)
    {
        $nombre = trim($this->request->getPost('nombre'));
        $descripcion = trim($this->request->getPost('descripcion'));

        if (empty($nombre)) {
            return redirect()->back()
                ->withInput()
                ->with('warning', 'El nombre de la categoría es obligatorio.');
        }

        $categoriaExistente = $this->categoriaModel
            ->where('nombre', $nombre)
            ->where('id_categoria !=', $id)
            ->first();
---
SELECT *
FROM `Categoria`
WHERE `nombre` = 'Terror'
AND `id_categoria` != '1'
 LIMIT 1