GestiLibro/app/Controllers/DashboardController.php

    public function index()
    {
        $libros = $this->libroModel->findAll();
        $prestamos = $this->prestamoModel->findAll();
        $usuarios = $this->usuarioModel->findAll();
---
SELECT *
FROM `Libro`
SELECT *
FROM `Prestamo`
SELECT *
FROM `Usuario`