GestiLibro/app/Controllers/LibroController.php

    public function index()
    {
        $disponibilidad = $this->request->getGet('disponibilidad');
        $data['libros'] = $this->libros->obtenerTodosConCategoria($disponibilidad);
        $data['categoryExist'] = $this->categorias->findAll();
---
SELECT *
FROM `Categoria`

    public function create()
    {
        $data['categorias'] = $this->categorias->findAll();
---
SELECT *
FROM `Categoria`