GestiLibro/app/Controllers/Login.php

    public function auth()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new UsuarioModel();
        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `Usuario`
WHERE `username` = 'Admin'
 LIMIT 1