GestiLibro/app/Controllers/PrestamoController.php

    public function index()
    {
        $authUser = AuthUser::getInstance()->getUser();
        $rol = strtolower($authUser['rol'] ?? '');

        if (in_array($rol, ['administrador', 'bibliotecario'])) {
            $data['prestamos'] = $this->prestamoModel->obtenerTodosConUsuarioYLibro();
        } else {
            $data['prestamos'] = $this->prestamoModel->obtenerPrestamosPorUsuario($authUser['id_usuario']);
        }

        $data['librosDisponibles'] = $this->libroModel
            ->where('disponibilidad', 'disponible')
            ->findAll();
---
SELECT *
FROM `Libro`
WHERE `disponibilidad` = 'disponible'

    public function edit($id)
    {
        $authUser = AuthUser::getInstance()->getUser();
        $rol = strtolower($authUser['rol'] ?? '');

        $data['prestamo'] = $this->prestamoModel->find($id);

        if (in_array($rol, ['administrador', 'bibliotecario'])) {
            $data['usuarios'] = $this->usuarioModel->where('active', 1)->findAll();
        } else {
            $data['usuarios'] = [$authUser];
        }

        $data['libros'] = $this->libroModel->findAll();
---
SELECT *
FROM `Usuario`
WHERE `active` = 1
SELECT *
FROM `Libro`