GestiLibro/app/Controllers/UsuarioController.php

SELECT *
FROM `Usuario`
---
    public function index()
    {
        $data['usuarios'] = $this->usuarioModel->findAll();