GestiLibro/app/Models/LibroModel.php

SELECT `Libro`.*, `Categoria`.`nombre` AS `categoria`
FROM `Libro`
LEFT JOIN `Categoria` ON `Categoria`.`id_categoria` = `Libro`.`id_categoria`
---
    public function obtenerLibros($disponibilidad = null)
    {
        $query = $this->select('Libro.*, Categoria.nombre AS categoria')
                      ->join('Categoria', 'Categoria.id_categoria = Libro.id_categoria', 'left');

        if (!empty($disponibilidad)) {
            $query->where('Libro.disponibilidad', $disponibilidad);
        }

        return $query->findAll();