GestiLibro/app/Models/PrestamoModel.php

    public function obtenerPrestamosPorUsuario($idUsuario)
    {
        return $this->select('Prestamo.*, Usuario.nombre as nombre_usuario, Usuario.apellido, Libro.titulo as titulo_libro')
                    ->join('Usuario', 'Usuario.id_usuario = Prestamo.id_usuario')
                    ->join('Libro', 'Libro.id_libro = Prestamo.id_libro')
                    ->where('Prestamo.id_usuario', $idUsuario)
                    ->findAll();
---
SELECT `Prestamo`.*, `Usuario`.`nombre` as `nombre_usuario`, `Usuario`.`apellido`, `Libro`.`titulo` as `titulo_libro`
FROM `Prestamo`
JOIN `Usuario` ON `Usuario`.`id_usuario` = `Prestamo`.`id_usuario`
JOIN `Libro` ON `Libro`.`id_libro` = `Prestamo`.`id_libro`
WHERE `Prestamo`.`id_usuario` = '3'