GestiLibro/app/Models/PrestamoModel.php

    public function obtenerTodosConUsuarioYLibro()
    {
        return $this->select('Prestamo.*, Usuario.nombre AS nombre_usuario, Usuario.apellido, Libro.titulo AS titulo_libro')
                    ->join('Usuario', 'Usuario.id_usuario = Prestamo.id_usuario')
                    ->join('Libro', 'Libro.id_libro = Prestamo.id_libro')
                    ->orderBy('Prestamo.id_prestamo', 'DESC')
                    ->findAll();
---
SELECT `Prestamo`.*, `Usuario`.`nombre` AS `nombre_usuario`, `Usuario`.`apellido`, `Libro`.`titulo` AS `titulo_libro`
FROM `Prestamo`
JOIN `Usuario` ON `Usuario`.`id_usuario` = `Prestamo`.`id_usuario`
JOIN `Libro` ON `Libro`.`id_libro` = `Prestamo`.`id_libro`
ORDER BY `Prestamo`.`id_prestamo` DESC

    public function contarPrestamosActivosPorLibro(int $idLibro): int
    {
        return $this->where('id_libro', $idLibro)
                    ->whereIn('estado', ['prestado', 'atrasado'])
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `Prestamo`
WHERE `id_libro` = 1
AND `estado` IN ('prestado','atrasado')