GestiLibro/app/Models/TareaModel.php

    public function conUsuario()
    {
        return $this->select('Tarea.*, Usuario.nombre as usuario')
                    ->join('Usuario', 'Usuario.id_usuario = Tarea.id_usuario')
                    ->findAll();
---
SELECT `Tarea`.*, `Usuario`.`nombre` as `usuario`
FROM `Tarea`
JOIN `Usuario` ON `Usuario`.`id_usuario` = `Tarea`.`id_usuario`