GestiLibro/app/Models/UsuarioModel.php

    public function obtenerRol()
    {
        return $this->join('Rol', 'Rol.id_rol = Usuario.id_rol')
                    ->select('Usuario.*, Rol.nombre as rol')
                    ->orderBy('Usuario.id_usuario', 'DESC')
                    ->findAll();
---
SELECT `Usuario`.*, `Rol`.`nombre` as `rol`
FROM `Usuario`
JOIN `Rol` ON `Rol`.`id_rol` = `Usuario`.`id_rol`
ORDER BY `Usuario`.`id_usuario` DESC

    public function getUsuarioConRol($idUsuario)
    {
        return $this->db->table('Usuario u')
            ->select('u.id_usuario, u.nombre, u.apellido, u.id_rol, r.nombre AS nombre_rol')
            ->join('Rol r', 'r.id_rol = u.id_rol')
            ->where('u.id_usuario', $idUsuario)
            ->get()
            ->getRowArray();
---
SELECT `u`.`id_usuario`, `u`.`nombre`, `u`.`apellido`, `u`.`id_rol`, `r`.`nombre` AS `nombre_rol`
FROM `Usuario` `u`
JOIN `Rol` `r` ON `r`.`id_rol` = `u`.`id_rol`
WHERE `u`.`id_usuario` = '1'